zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/interrupt-controller/hc32f4a0-int-evt.h
/**
 * @brief Event Source Number
 */
#define EVT_SRC_SWI_IRQ0  0  /* SWI_IRQ0  */
#define EVT_SRC_SWI_IRQ1  1  /* SWI_IRQ1  */
#define EVT_SRC_SWI_IRQ2  2  /* SWI_IRQ2  */
#define EVT_SRC_SWI_IRQ3  3  /* SWI_IRQ3  */
#define EVT_SRC_SWI_IRQ4  4  /* SWI_IRQ4  */
#define EVT_SRC_SWI_IRQ5  5  /* SWI_IRQ5  */
#define EVT_SRC_SWI_IRQ6  6  /* SWI_IRQ6  */
#define EVT_SRC_SWI_IRQ7  7  /* SWI_IRQ7  */
#define EVT_SRC_SWI_IRQ8  8  /* SWI_IRQ8  */
#define EVT_SRC_SWI_IRQ9  9  /* SWI_IRQ9  */
#define EVT_SRC_SWI_IRQ10 10 /* SWI_IRQ10 */
#define EVT_SRC_SWI_IRQ11 11 /* SWI_IRQ11 */
#define EVT_SRC_SWI_IRQ12 12 /* SWI_IRQ12 */
#define EVT_SRC_SWI_IRQ13 13 /* SWI_IRQ13 */
#define EVT_SRC_SWI_IRQ14 14 /* SWI_IRQ14 */
#define EVT_SRC_SWI_IRQ15 15 /* SWI_IRQ15 */
#define EVT_SRC_SWI_IRQ16 16 /* SWI_IRQ16 */
#define EVT_SRC_SWI_IRQ17 17 /* SWI_IRQ17 */
#define EVT_SRC_SWI_IRQ18 18 /* SWI_IRQ18 */
#define EVT_SRC_SWI_IRQ19 19 /* SWI_IRQ19 */
#define EVT_SRC_SWI_IRQ20 20 /* SWI_IRQ20 */
#define EVT_SRC_SWI_IRQ21 21 /* SWI_IRQ21 */
#define EVT_SRC_SWI_IRQ22 22 /* SWI_IRQ22 */
#define EVT_SRC_SWI_IRQ23 23 /* SWI_IRQ23 */
#define EVT_SRC_SWI_IRQ24 24 /* SWI_IRQ24 */
#define EVT_SRC_SWI_IRQ25 25 /* SWI_IRQ25 */
#define EVT_SRC_SWI_IRQ26 26 /* SWI_IRQ26 */
#define EVT_SRC_SWI_IRQ27 27 /* SWI_IRQ27 */
#define EVT_SRC_SWI_IRQ28 28 /* SWI_IRQ28 */
#define EVT_SRC_SWI_IRQ29 29 /* SWI_IRQ29 */
#define EVT_SRC_SWI_IRQ30 30 /* SWI_IRQ30 */
#define EVT_SRC_SWI_IRQ31 31 /* SWI_IRQ31 */

/* External Interrupt. */
#define EVT_SRC_PORT_EIRQ0  0  /* PORT_EIRQ0  */
#define EVT_SRC_PORT_EIRQ1  1  /* PORT_EIRQ1  */
#define EVT_SRC_PORT_EIRQ2  2  /* PORT_EIRQ2  */
#define EVT_SRC_PORT_EIRQ3  3  /* PORT_EIRQ3  */
#define EVT_SRC_PORT_EIRQ4  4  /* PORT_EIRQ4  */
#define EVT_SRC_PORT_EIRQ5  5  /* PORT_EIRQ5  */
#define EVT_SRC_PORT_EIRQ6  6  /* PORT_EIRQ6  */
#define EVT_SRC_PORT_EIRQ7  7  /* PORT_EIRQ7  */
#define EVT_SRC_PORT_EIRQ8  8  /* PORT_EIRQ8  */
#define EVT_SRC_PORT_EIRQ9  9  /* PORT_EIRQ9  */
#define EVT_SRC_PORT_EIRQ10 10 /* PORT_EIRQ10 */
#define EVT_SRC_PORT_EIRQ11 11 /* PORT_EIRQ11 */
#define EVT_SRC_PORT_EIRQ12 12 /* PORT_EIRQ12 */
#define EVT_SRC_PORT_EIRQ13 13 /* PORT_EIRQ13 */
#define EVT_SRC_PORT_EIRQ14 14 /* PORT_EIRQ14 */
#define EVT_SRC_PORT_EIRQ15 15 /* PORT_EIRQ15 */

/*  DMA_1  */
#define EVT_SRC_DMA1_TC0        32U /* DMA_1_TC0 */
#define EVT_SRC_DMA1_TC1        33U /* DMA_1_TC1 */
#define EVT_SRC_DMA1_TC2        34U /* DMA_1_TC2 */
#define EVT_SRC_DMA1_TC3        35U /* DMA_1_TC3 */
#define EVT_SRC_DMA1_TC4        36U /* DMA_1_TC4 */
#define EVT_SRC_DMA1_TC5        37U /* DMA_1_TC5 */
#define EVT_SRC_DMA1_TC6        38U /* DMA_1_TC6 */
#define EVT_SRC_DMA1_TC7        39U /* DMA_1_TC7 */
#define EVT_SRC_DMA1_BTC0       40U /* DMA_1_BTC0 */
#define EVT_SRC_DMA1_BTC1       41U /* DMA_1_BTC1 */
#define EVT_SRC_DMA1_BTC2       42U /* DMA_1_BTC2 */
#define EVT_SRC_DMA1_BTC3       43U /* DMA_1_BTC3 */
#define EVT_SRC_DMA1_BTC4       44U /* DMA_1_BTC4 */
#define EVT_SRC_DMA1_BTC5       45U /* DMA_1_BTC5 */
#define EVT_SRC_DMA1_BTC6       46U /* DMA_1_BTC6 */
#define EVT_SRC_DMA1_BTC7       47U /* DMA_1_BTC7 */
/*  EFM  */
#define EVT_SRC_EFM_OPTEND      51U /* EFM_OPTEND */
/*  USBFS  */
#define EVT_SRC_USBFS_SOF       52U /* USBFS_SOF */
/*  USBHS  */
#define EVT_SRC_USBHS_SOF       53U /* USBHS_SOF */
/*  DCU  */
#define EVT_SRC_DCU1            55U /* DCU1 */
#define EVT_SRC_DCU2            56U /* DCU2 */
#define EVT_SRC_DCU3            57U /* DCU3 */
#define EVT_SRC_DCU4            58U /* DCU4 */
#define EVT_SRC_DCU5            59U /* DCU5 */
#define EVT_SRC_DCU6            60U /* DCU6 */
#define EVT_SRC_DCU7            61U /* DCU7 */
#define EVT_SRC_DCU8            62U /* DCU8 */
/*  DMA_2  */
#define EVT_SRC_DMA2_TC0        64U /* DMA_2_TC0 */
#define EVT_SRC_DMA2_TC1        65U /* DMA_2_TC1 */
#define EVT_SRC_DMA2_TC2        66U /* DMA_2_TC2 */
#define EVT_SRC_DMA2_TC3        67U /* DMA_2_TC3 */
#define EVT_SRC_DMA2_TC4        68U /* DMA_2_TC4 */
#define EVT_SRC_DMA2_TC5        69U /* DMA_2_TC5 */
#define EVT_SRC_DMA2_TC6        70U /* DMA_2_TC6 */
#define EVT_SRC_DMA2_TC7        71U /* DMA_2_TC7 */
#define EVT_SRC_DMA2_BTC0       72U /* DMA_2_BTC0 */
#define EVT_SRC_DMA2_BTC1       73U /* DMA_2_BTC1 */
#define EVT_SRC_DMA2_BTC2       74U /* DMA_2_BTC2 */
#define EVT_SRC_DMA2_BTC3       75U /* DMA_2_BTC3 */
#define EVT_SRC_DMA2_BTC4       76U /* DMA_2_BTC4 */
#define EVT_SRC_DMA2_BTC5       77U /* DMA_2_BTC5 */
#define EVT_SRC_DMA2_BTC6       78U /* DMA_2_BTC6 */
#define EVT_SRC_DMA2_BTC7       79U /* DMA_2_BTC7 */
/*  MAU  */
#define EVT_SRC_MAU_SQRT        83U /* MAU_SQRT */
/*  DVP  */
#define EVT_SRC_DVP_FRAMSTA     84U /* DVP_FRAMSTA */
#define EVT_SRC_DVP_LINESTA     85U /* DVP_LINESTA */
#define EVT_SRC_DVP_LINEEND     86U /* DVP_LINEEND */
#define EVT_SRC_DVP_FRAMEND     87U /* DVP_FRAMEND */
#define EVT_SRC_DVP_SQUERR      88U /* DVP_SQUERR */
#define EVT_SRC_DVP_FIFOERR     89U /* DVP_FIFOERR */
#define EVT_SRC_DVP_DMAREQ      90U /* DVP_DMAREQ */
/*  FMAC  */
#define EVT_SRC_FMAC_1          91U /* FMAC_1_FIR */
#define EVT_SRC_FMAC_2          92U /* FMAC_2_FIR */
#define EVT_SRC_FMAC_3          93U /* FMAC_3_FIR */
#define EVT_SRC_FMAC_4          94U /* FMAC_4_FIR */
/*  TIMER0  */
#define EVT_SRC_TMR0_1_CMP_A    96U /* TMR0_1_CMPA */
#define EVT_SRC_TMR0_1_CMP_B    97U /* TMR0_1_CMPB */
#define EVT_SRC_TMR0_2_CMP_A    98U /* TMR0_2_CMPA */
#define EVT_SRC_TMR0_2_CMP_B    99U /* TMR0_2_CMPB */
/*  TIMER2  */
#define EVT_SRC_TMR2_1_CMP_A    100U /* TMR2_1_CMPA  */
#define EVT_SRC_TMR2_1_CMP_B    101U /* TMR2_1_CMPB  */
#define EVT_SRC_TMR2_1_OVF_A    102U /* TMR2_1_OVFA  */
#define EVT_SRC_TMR2_1_OVF_B    103U /* TMR2_1_OVFB  */
#define EVT_SRC_TMR2_2_CMP_A    104U /* TMR2_2_CMPA  */
#define EVT_SRC_TMR2_2_CMP_B    105U /* TMR2_2_CMPB  */
#define EVT_SRC_TMR2_2_OVF_A    106U /* TMR2_2_OVFA  */
#define EVT_SRC_TMR2_2_OVF_B    107U /* TMR2_2_OVFB  */
#define EVT_SRC_TMR2_3_CMP_A    108U /* TMR2_3_CMPA  */
#define EVT_SRC_TMR2_3_CMP_B    109U /* TMR2_3_CMPB  */
#define EVT_SRC_TMR2_3_OVF_A    110U /* TMR2_3_OVFA  */
#define EVT_SRC_TMR2_3_OVF_B    111U /* TMR2_3_OVFB  */
#define EVT_SRC_TMR2_4_CMP_A    112U /* TMR2_4_CMPA  */
#define EVT_SRC_TMR2_4_CMP_B    113U /* TMR2_4_CMPB  */
#define EVT_SRC_TMR2_4_OVF_A    114U /* TMR2_4_OVFA  */
#define EVT_SRC_TMR2_4_OVF_B    115U /* TMR2_4_OVFB  */
/*  RTC  */
#define EVT_SRC_RTC_ALM         121U /* RTC_ALM */
#define EVT_SRC_RTC_PRD         122U /* RTC_PRD */
/*  TIMER6_1  */
#define EVT_SRC_TMR6_1_GCMP_A   128U /* TMR6_1_GCMA */
#define EVT_SRC_TMR6_1_GCMP_B   129U /* TMR6_1_GCMB */
#define EVT_SRC_TMR6_1_GCMP_C   130U /* TMR6_1_GCMC */
#define EVT_SRC_TMR6_1_GCMP_D   131U /* TMR6_1_GCMD */
#define EVT_SRC_TMR6_1_GCMP_E   132U /* TMR6_1_GCME */
#define EVT_SRC_TMR6_1_GCMP_F   133U /* TMR6_1_GCMF */
#define EVT_SRC_TMR6_1_OVF      134U /* TMR6_1_GOVF */
#define EVT_SRC_TMR6_1_UDF      135U /* TMR6_1_GUDF */
/*  TIMER4_1  */
#define EVT_SRC_TMR4_1_SCMP0    136U /* TMR4_1_SCM0 */
#define EVT_SRC_TMR4_1_SCMP1    137U /* TMR4_1_SCM1 */
#define EVT_SRC_TMR4_1_SCMP2    138U /* TMR4_1_SCM2 */
#define EVT_SRC_TMR4_1_SCMP3    139U /* TMR4_1_SCM3 */
#define EVT_SRC_TMR4_1_SCMP4    140U /* TMR4_1_SCM4 */
#define EVT_SRC_TMR4_1_SCMP5    141U /* TMR4_1_SCM5 */
/*  TIMER6_2  */
#define EVT_SRC_TMR6_2_GCMP_A   144U /* TMR6_2_GCMA */
#define EVT_SRC_TMR6_2_GCMP_B   145U /* TMR6_2_GCMB */
#define EVT_SRC_TMR6_2_GCMP_C   146U /* TMR6_2_GCMC */
#define EVT_SRC_TMR6_2_GCMP_D   147U /* TMR6_2_GCMD */
#define EVT_SRC_TMR6_2_GCMP_E   148U /* TMR6_2_GCME */
#define EVT_SRC_TMR6_2_GCMP_F   149U /* TMR6_2_GCMF */
#define EVT_SRC_TMR6_2_OVF      150U /* TMR6_2_GOVF */
#define EVT_SRC_TMR6_2_UDF      151U /* TMR6_2_GUDF */
/*  TIMER4_2  */
#define EVT_SRC_TMR4_2_SCMP0    152U /* TMR4_2_SCM0 */
#define EVT_SRC_TMR4_2_SCMP1    153U /* TMR4_2_SCM1 */
#define EVT_SRC_TMR4_2_SCMP2    154U /* TMR4_2_SCM2 */
#define EVT_SRC_TMR4_2_SCMP3    155U /* TMR4_2_SCM3 */
#define EVT_SRC_TMR4_2_SCMP4    156U /* TMR4_2_SCM4 */
#define EVT_SRC_TMR4_2_SCMP5    157U /* TMR4_2_SCM5 */
/*  TIMER6_3  */
#define EVT_SRC_TMR6_3_GCMP_A   160U /* TMR6_3_GCMA */
#define EVT_SRC_TMR6_3_GCMP_B   161U /* TMR6_3_GCMB */
#define EVT_SRC_TMR6_3_GCMP_C   162U /* TMR6_3_GCMC */
#define EVT_SRC_TMR6_3_GCMP_D   163U /* TMR6_3_GCMD */
#define EVT_SRC_TMR6_3_GCMP_E   164U /* TMR6_3_GCME */
#define EVT_SRC_TMR6_3_GCMP_F   165U /* TMR6_3_GCMF */
#define EVT_SRC_TMR6_3_OVF      166U /* TMR6_3_GOVF */
#define EVT_SRC_TMR6_3_UDF      167U /* TMR6_3_GUDF */
/*  TIMER4_3  */
#define EVT_SRC_TMR4_3_SCMP0    168U /* TMR4_3_SCM0 */
#define EVT_SRC_TMR4_3_SCMP1    169U /* TMR4_3_SCM1 */
#define EVT_SRC_TMR4_3_SCMP2    170U /* TMR4_3_SCM2 */
#define EVT_SRC_TMR4_3_SCMP3    171U /* TMR4_3_SCM3 */
#define EVT_SRC_TMR4_3_SCMP4    172U /* TMR4_3_SCM4 */
#define EVT_SRC_TMR4_3_SCMP5    173U /* TMR4_3_SCM5 */
/*  TIMER6  */
#define EVT_SRC_TMR6_1_SCMP_A   179U /* TMR6_1_SCMA */
#define EVT_SRC_TMR6_1_SCMP_B   180U /* TMR6_1_SCMB */
#define EVT_SRC_TMR6_2_SCMP_A   187U /* TMR6_2_SCMA */
#define EVT_SRC_TMR6_2_SCMP_B   188U /* TMR6_2_SCMB */
#define EVT_SRC_TMR6_3_SCMP_A   195U /* TMR6_3_SCMA */
#define EVT_SRC_TMR6_3_SCMP_B   196U /* TMR6_3_SCMB */
#define EVT_SRC_TMR6_4_GCMP_A   208U /* TMR6_4_GCMA */
#define EVT_SRC_TMR6_4_GCMP_B   209U /* TMR6_4_GCMB */
#define EVT_SRC_TMR6_4_GCMP_C   210U /* TMR6_4_GCMC */
#define EVT_SRC_TMR6_4_GCMP_D   211U /* TMR6_4_GCMD */
#define EVT_SRC_TMR6_4_GCMP_E   212U /* TMR6_4_GCME */
#define EVT_SRC_TMR6_4_GCMP_F   213U /* TMR6_4_GCMF */
#define EVT_SRC_TMR6_4_OVF      214U /* TMR6_4_GOVF */
#define EVT_SRC_TMR6_4_UDF      215U /* TMR6_4_GUDF */
#define EVT_SRC_TMR6_4_SCMP_A   219U /* TMR6_4_SCMA */
#define EVT_SRC_TMR6_4_SCMP_B   220U /* TMR6_4_SCMB */
#define EVT_SRC_TMR6_5_GCMP_A   224U /* TMR6_5_GCMA */
#define EVT_SRC_TMR6_5_GCMP_B   225U /* TMR6_5_GCMB */
#define EVT_SRC_TMR6_5_GCMP_C   226U /* TMR6_5_GCMC */
#define EVT_SRC_TMR6_5_GCMP_D   227U /* TMR6_5_GCMD */
#define EVT_SRC_TMR6_5_GCMP_E   228U /* TMR6_5_GCME */
#define EVT_SRC_TMR6_5_GCMP_F   229U /* TMR6_5_GCMF */
#define EVT_SRC_TMR6_5_OVF      230U /* TMR6_5_GOVF */
#define EVT_SRC_TMR6_5_UDF      231U /* TMR6_5_GUDF */
#define EVT_SRC_TMR6_5_SCMP_A   235U /* TMR6_5_SCMA */
#define EVT_SRC_TMR6_5_SCMP_B   236U /* TMR6_5_SCMB */
/*  TIMERA_1  */
#define EVT_SRC_TMRA_1_OVF      237U /* TMRA_1_OVF */
#define EVT_SRC_TMRA_1_UDF      238U /* TMRA_1_UDF */
#define EVT_SRC_TMRA_1_CMP      239U /* TMRA_1_CMP */
/*  TIMER6_6  */
#define EVT_SRC_TMR6_6_GCMP_A   240U /* TMR6_6_GCMA */
#define EVT_SRC_TMR6_6_GCMP_B   241U /* TMR6_6_GCMB */
#define EVT_SRC_TMR6_6_GCMP_C   242U /* TMR6_6_GCMC */
#define EVT_SRC_TMR6_6_GCMP_D   243U /* TMR6_6_GCMD */
#define EVT_SRC_TMR6_6_GCMP_E   244U /* TMR6_6_GCME */
#define EVT_SRC_TMR6_6_GCMP_F   245U /* TMR6_6_GCMF */
#define EVT_SRC_TMR6_6_OVF      246U /* TMR6_6_GOVF */
#define EVT_SRC_TMR6_6_UDF      247U /* TMR6_6_GUDF */
#define EVT_SRC_TMR6_6_SCMP_A   251U /* TMR6_6_SCMA */
#define EVT_SRC_TMR6_6_SCMP_B   252U /* TMR6_6_SCMB */
/*  TIMERA_2  */
#define EVT_SRC_TMRA_2_OVF      253U /* TMRA_2_OVF */
#define EVT_SRC_TMRA_2_UDF      254U /* TMRA_2_UDF */
#define EVT_SRC_TMRA_2_CMP      255U /* TMRA_2_CMP */
/*  TIMER6_7  */
#define EVT_SRC_TMR6_7_GCMP_A   256U /* TMR6_7_GCMA */
#define EVT_SRC_TMR6_7_GCMP_B   257U /* TMR6_7_GCMB */
#define EVT_SRC_TMR6_7_GCMP_C   258U /* TMR6_7_GCMC */
#define EVT_SRC_TMR6_7_GCMP_D   259U /* TMR6_7_GCMD */
#define EVT_SRC_TMR6_7_GCMP_E   260U /* TMR6_7_GCME */
#define EVT_SRC_TMR6_7_GCMP_F   261U /* TMR6_7_GCMF */
#define EVT_SRC_TMR6_7_OVF      262U /* TMR6_7_GOVF */
#define EVT_SRC_TMR6_7_UDF      263U /* TMR6_7_GUDF */
#define EVT_SRC_TMR6_7_SCMP_A   267U /* TMR6_7_SCMA */
#define EVT_SRC_TMR6_7_SCMP_B   268U /* TMR6_7_SCMB */
/*  TIMERA_3  */
#define EVT_SRC_TMRA_3_OVF      269U /* TMRA_3_OVF */
#define EVT_SRC_TMRA_3_UDF      270U /* TMRA_3_UDF */
#define EVT_SRC_TMRA_3_CMP      271U /* TMRA_3_CMP */
/*  TIMER6_8  */
#define EVT_SRC_TMR6_8_GCMP_A   272U /* TMR6_8_GCMA */
#define EVT_SRC_TMR6_8_GCMP_B   273U /* TMR6_8_GCMB */
#define EVT_SRC_TMR6_8_GCMP_C   274U /* TMR6_8_GCMC */
#define EVT_SRC_TMR6_8_GCMP_D   275U /* TMR6_8_GCMD */
#define EVT_SRC_TMR6_8_GCMP_E   276U /* TMR6_8_GCME */
#define EVT_SRC_TMR6_8_GCMP_F   277U /* TMR6_8_GCMF */
#define EVT_SRC_TMR6_8_OVF      278U /* TMR6_8_GOVF */
#define EVT_SRC_TMR6_8_UDF      279U /* TMR6_8_GUDF */
#define EVT_SRC_TMR6_8_SCMP_A   283U /* TMR6_8_SCMA */
#define EVT_SRC_TMR6_8_SCMP_B   284U /* TMR6_8_SCMB */
/*  TIMERA_4  */
#define EVT_SRC_TMRA_4_OVF      285U /* TMRA_4_OVF */
#define EVT_SRC_TMRA_4_UDF      286U /* TMRA_4_UDF */
#define EVT_SRC_TMRA_4_CMP      287U /* TMRA_4_CMP */
/*  AOS_STRG  */
#define EVT_SRC_AOS_STRG        299U /* AOS_STRG */
/*  USART1 USART2  */
#define EVT_SRC_USART1_EI       300U /* USART_1_EI */
#define EVT_SRC_USART1_RI       301U /* USART_1_RI */
#define EVT_SRC_USART1_TI       302U /* USART_1_TI */
#define EVT_SRC_USART1_TCI      303U /* USART_1_TCI */
#define EVT_SRC_USART1_RTO      304U /* USART_1_RTO */
#define EVT_SRC_USART2_EI       305U /* USART_2_EI */
#define EVT_SRC_USART2_RI       306U /* USART_2_RI */
#define EVT_SRC_USART2_TI       307U /* USART_2_TI */
#define EVT_SRC_USART2_TCI      308U /* USART_2_TCI */
#define EVT_SRC_USART2_RTO      309U /* USART_2_RTO */
/*  SPI1 SPI2  */
#define EVT_SRC_SPI1_SPRI       310U /* SPI_1_SPRI */
#define EVT_SRC_SPI1_SPTI       311U /* SPI_1_SPTI */
#define EVT_SRC_SPI1_SPII       312U /* SPI_1_SPII */
#define EVT_SRC_SPI1_SPEI       313U /* SPI_1_SPEI */
#define EVT_SRC_SPI1_SPEND      314U /* SPI_1_SPEND */
#define EVT_SRC_SPI2_SPRI       315U /* SPI_2_SPRI */
#define EVT_SRC_SPI2_SPTI       316U /* SPI_2_SPTI */
#define EVT_SRC_SPI2_SPII       317U /* SPI_2_SPII */
#define EVT_SRC_SPI2_SPEI       318U /* SPI_2_SPEI */
#define EVT_SRC_SPI2_SPEND      319U /* SPI_2_SPEND */
/*  TIMERA_5 TIMERA_6 TIMERA_7 TIMERA_8  */
#define EVT_SRC_TMRA_5_OVF      320U /* TMRA_5_OVF */
#define EVT_SRC_TMRA_5_UDF      321U /* TMRA_5_UDF */
#define EVT_SRC_TMRA_5_CMP      322U /* TMRA_5_CMP */
#define EVT_SRC_TMRA_6_OVF      323U /* TMRA_6_OVF */
#define EVT_SRC_TMRA_6_UDF      324U /* TMRA_6_UDF */
#define EVT_SRC_TMRA_6_CMP      325U /* TMRA_6_CMP */
#define EVT_SRC_TMRA_7_OVF      326U /* TMRA_7_OVF */
#define EVT_SRC_TMRA_7_UDF      327U /* TMRA_7_UDF */
#define EVT_SRC_TMRA_7_CMP      328U /* TMRA_7_CMP */
#define EVT_SRC_TMRA_8_OVF      329U /* TMRA_8_OVF */
#define EVT_SRC_TMRA_8_UDF      330U /* TMRA_8_UDF */
#define EVT_SRC_TMRA_8_CMP      331U /* TMRA_8_CMP */
/*  USART3 USART4  */
#define EVT_SRC_USART3_EI       332U /* USART_3_EI */
#define EVT_SRC_USART3_RI       333U /* USART_3_RI */
#define EVT_SRC_USART3_TI       334U /* USART_3_TI */
#define EVT_SRC_USART3_TCI      335U /* USART_3_TCI */
#define EVT_SRC_USART4_EI       336U /* USART_4_EI */
#define EVT_SRC_USART4_RI       337U /* USART_4_RI */
#define EVT_SRC_USART4_TI       338U /* USART_4_TI */
#define EVT_SRC_USART4_TCI      339U /* USART_4_TCI */
/*  SPI3 SPI4  */
#define EVT_SRC_SPI3_SPRI       342U /* SPI_3_SPRI */
#define EVT_SRC_SPI3_SPTI       343U /* SPI_3_SPTI */
#define EVT_SRC_SPI3_SPII       344U /* SPI_3_SPII */
#define EVT_SRC_SPI3_SPEI       345U /* SPI_3_SPEI */
#define EVT_SRC_SPI3_SPEND      346U /* SPI_3_SPEND */
#define EVT_SRC_SPI4_SPRI       347U /* SPI_4_SPRI */
#define EVT_SRC_SPI4_SPTI       348U /* SPI_4_SPTI */
#define EVT_SRC_SPI4_SPII       349U /* SPI_4_SPII */
#define EVT_SRC_SPI4_SPEI       350U /* SPI_4_SPEI */
#define EVT_SRC_SPI4_SPEND      351U /* SPI_4_SPEND */
/*  TIMERA_9 TIMERA_10 TIMERA_11 TIMERA_12  */
#define EVT_SRC_TMRA_9_OVF      352U /* TMRA_9_OVF */
#define EVT_SRC_TMRA_9_UDF      353U /* TMRA_9_UDF */
#define EVT_SRC_TMRA_9_CMP      354U /* TMRA_9_CMP */
#define EVT_SRC_TMRA_10_OVF     355U /* TMRA_10_OVF */
#define EVT_SRC_TMRA_10_UDF     356U /* TMRA_10_UDF */
#define EVT_SRC_TMRA_10_CMP     357U /* TMRA_10_CMP */
#define EVT_SRC_TMRA_11_OVF     358U /* TMRA_11_OVF */
#define EVT_SRC_TMRA_11_UDF     359U /* TMRA_11_UDF */
#define EVT_SRC_TMRA_11_CMP     360U /* TMRA_11_CMP */
#define EVT_SRC_TMRA_12_OVF     361U /* TMRA_12_OVF */
#define EVT_SRC_TMRA_12_UDF     362U /* TMRA_12_UDF */
#define EVT_SRC_TMRA_12_CMP     363U /* TMRA_12_CMP */
/*  USART5 USART6  */
#define EVT_SRC_USART5_BRKWKPI  364U /* USART_5_BRKWKPI */
#define EVT_SRC_USART5_EI       365U /* USART_5_EI */
#define EVT_SRC_USART5_RI       366U /* USART_5_RI */
#define EVT_SRC_USART5_TI       367U /* USART_5_TI */
#define EVT_SRC_USART5_TCI      368U /* USART_5_TCI */
#define EVT_SRC_USART6_EI       369U /* USART_6_EI */
#define EVT_SRC_USART6_RI       370U /* USART_6_RI */
#define EVT_SRC_USART6_TI       371U /* USART_6_TI */
#define EVT_SRC_USART6_TCI      372U /* USART_6_TCI */
#define EVT_SRC_USART6_RTO      373U /* USART_6_RTO */
/*  SPI5 SPI6  */
#define EVT_SRC_SPI5_SPRI       374U /* SPI_5_SPRI */
#define EVT_SRC_SPI5_SPTI       375U /* SPI_5_SPTI */
#define EVT_SRC_SPI5_SPII       376U /* SPI_5_SPII */
#define EVT_SRC_SPI5_SPEI       377U /* SPI_5_SPEI */
#define EVT_SRC_SPI5_SPEND      378U /* SPI_5_SPEND */
#define EVT_SRC_SPI6_SPRI       379U /* SPI_6_SPRI */
#define EVT_SRC_SPI6_SPTI       380U /* SPI_6_SPTI */
#define EVT_SRC_SPI6_SPII       381U /* SPI_6_SPII */
#define EVT_SRC_SPI6_SPEI       382U /* SPI_6_SPEI */
#define EVT_SRC_SPI6_SPEND      383U /* SPI_6_SPEND */
/*  I2S1 I2S2  */
#define EVT_SRC_I2S1_TXIRQOUT   384U /* I2S_1_TXIRQOUT */
#define EVT_SRC_I2S1_RXIRQOUT   385U /* I2S_1_RXIRQOUT */
#define EVT_SRC_I2S2_TXIRQOUT   387U /* I2S_2_TXIRQOUT */
#define EVT_SRC_I2S2_RXIRQOUT   388U /* I2S_2_RXIRQOUT */
/*  USART7 USART8  */
#define EVT_SRC_USART7_EI       390U /* USART_7_EI */
#define EVT_SRC_USART7_RI       391U /* USART_7_RI */
#define EVT_SRC_USART7_TI       392U /* USART_7_TI */
#define EVT_SRC_USART7_TCI      393U /* USART_7_TCI */
#define EVT_SRC_USART7_RTO      394U /* USART_7_RTO */
#define EVT_SRC_USART8_EI       395U /* USART_8_EI */
#define EVT_SRC_USART8_RI       396U /* USART_8_RI */
#define EVT_SRC_USART8_TI       397U /* USART_8_TI */
#define EVT_SRC_USART8_TCI      398U /* USART_8_TCI */
/*  HASH  */
#define EVT_SRC_HASH            401U /* HASH_INT */
/*  SDIOC  */
#define EVT_SRC_SDIOC1_DMAR     402U /* SDIOC_1_DMAR */
#define EVT_SRC_SDIOC1_DMAW     403U /* SDIOC_1_DMAW */
#define EVT_SRC_SDIOC2_DMAR     405U /* SDIOC_2_DMAR */
#define EVT_SRC_SDIOC2_DMAW     406U /* SDIOC_2_DMAW */
/*  EVENT PORT  */
#define EVT_SRC_EVENT_PORT1     408U /* EVENT_PORT1 */
#define EVT_SRC_EVENT_PORT2     409U /* EVENT_PORT2 */
#define EVT_SRC_EVENT_PORT3     410U /* EVENT_PORT3 */
#define EVT_SRC_EVENT_PORT4     411U /* EVENT_PORT4 */
/*  ETHER  */
#define EVT_SRC_ETH_PPS_OUT_0   414U /* ETH_PPS_OUT_0 */
#define EVT_SRC_ETH_PPS_OUT_1   415U /* ETH_PPS_OUT_1 */
/*  I2S3 I2S4  */
#define EVT_SRC_I2S3_TXIRQOUT   416U /* I2S_3_TXIRQOUT */
#define EVT_SRC_I2S3_RXIRQOUT   417U /* I2S_3_RXIRQOUT */
#define EVT_SRC_I2S4_TXIRQOUT   419U /* I2S_4_TXIRQOUT */
#define EVT_SRC_I2S4_RXIRQOUT   420U /* I2S_4_RXIRQOUT */
/*  USART9 USART10  */
#define EVT_SRC_USART9_EI       422U /* USART_9_EI */
#define EVT_SRC_USART9_RI       423U /* USART_9_RI */
#define EVT_SRC_USART9_TI       424U /* USART_9_TI */
#define EVT_SRC_USART9_TCI      425U /* USART_9_TCI */
#define EVT_SRC_USART10_BRKWKPI 426U /* USART_10_BRKWKPI */
#define EVT_SRC_USART10_EI      427U /* USART_10_EI */
#define EVT_SRC_USART10_RI      428U /* USART_10_RI */
#define EVT_SRC_USART10_TI      429U /* USART_10_TI */
#define EVT_SRC_USART10_TCI     430U /* USART_10_TCI */
/*  I2C1 I2C2 I2C3  */
#define EVT_SRC_I2C1_RXI        432U /* I2C_1_RXI */
#define EVT_SRC_I2C1_TXI        433U /* I2C_1_TXI */
#define EVT_SRC_I2C1_TEI        434U /* I2C_1_TEI */
#define EVT_SRC_I2C1_EEI        435U /* I2C_1_EEI */
#define EVT_SRC_I2C2_RXI        436U /* I2C_2_RXI */
#define EVT_SRC_I2C2_TXI        437U /* I2C_2_TXI */
#define EVT_SRC_I2C2_TEI        438U /* I2C_2_TEI */
#define EVT_SRC_I2C2_EEI        439U /* I2C_2_EEI */
#define EVT_SRC_I2C3_RXI        440U /* I2C_3_RXI */
#define EVT_SRC_I2C3_TXI        441U /* I2C_3_TXI */
#define EVT_SRC_I2C3_TEI        442U /* I2C_3_TEI */
#define EVT_SRC_I2C3_EEI        443U /* I2C_3_EEI */
/*  ACMP  */
#define EVT_SRC_CMP1            444U /* CMP1 */
#define EVT_SRC_CMP2            445U /* CMP2 */
#define EVT_SRC_CMP3            446U /* CMP3 */
#define EVT_SRC_CMP4            447U /* CMP4 */
/*  I2C4 I2C5 I2C6  */
#define EVT_SRC_I2C4_RXI        448U /* I2C_4_RXI */
#define EVT_SRC_I2C4_TXI        449U /* I2C_4_TXI */
#define EVT_SRC_I2C4_TEI        450U /* I2C_4_TEI */
#define EVT_SRC_I2C4_EEI        451U /* I2C_4_EEI */
#define EVT_SRC_I2C5_RXI        452U /* I2C_5_RXI */
#define EVT_SRC_I2C5_TXI        453U /* I2C_5_TXI */
#define EVT_SRC_I2C5_TEI        454U /* I2C_5_TEI */
#define EVT_SRC_I2C5_EEI        455U /* I2C_5_EEI */
#define EVT_SRC_I2C6_RXI        456U /* I2C_6_RXI */
#define EVT_SRC_I2C6_TXI        457U /* I2C_6_TXI */
#define EVT_SRC_I2C6_TEI        458U /* I2C_6_TEI */
#define EVT_SRC_I2C6_EEI        459U /* I2C_6_EEI */
/*  LVD  */
#define EVT_SRC_LVD1            461U /* LVD1 */
#define EVT_SRC_LVD2            462U /* LVD2 */
/*  OTS  */
#define EVT_SRC_OTS             463U /* OTS */
/*  WDT  */
#define EVT_SRC_WDT_REFUDF      467U /* WDT_REFUDF */
/*  ADC  */
#define EVT_SRC_ADC1_EOCA       480U /* ADC_1_EOCA */
#define EVT_SRC_ADC1_EOCB       481U /* ADC_1_EOCB */
#define EVT_SRC_ADC1_CMP0       482U /* ADC_1_CMP0 */
#define EVT_SRC_ADC1_CMP1       483U /* ADC_1_CMP1 */
#define EVT_SRC_ADC2_EOCA       484U /* ADC_2_EOCA */
#define EVT_SRC_ADC2_EOCB       485U /* ADC_2_EOCB */
#define EVT_SRC_ADC2_CMP0       486U /* ADC_2_CMP0 */
#define EVT_SRC_ADC2_CMP1       487U /* ADC_2_CMP1 */
#define EVT_SRC_ADC3_EOCA       488U /* ADC_3_EOCA */
#define EVT_SRC_ADC3_EOCB       489U /* ADC_3_EOCB */
#define EVT_SRC_ADC3_CMP0       490U /* ADC_3_CMP0 */
#define EVT_SRC_ADC3_CMP1       491U /* ADC_3_CMP1 */
/*  TRNG  */
#define EVT_SRC_TRNG_END        492U /* TRNG_END */
#define EVT_SRC_MAX             511U

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_INTERRUPT_CONTROLLER_HC32F4A0_INT_EVT_H_ */
